




--Манипуляции с числами




    -------------------------------------------
    -- Сравните два числа с учетом погрешности плавающей запятой
    local function compare(x,y);
        local floatShare = 0.0000001;
        return math.abs(x-y) < floatShare;
    end;
    -------------------------------------------
    
    
    
    
    -------------------------------------------
    -- узнать целое ли число с учетом погрешности плавающей запятой
    local function IntegerNumber(x);
        return math.abs(x-math.floor(x+.5))<0.0000001;
    end;
    -------------------------------------------
